trunk/budget/app/controllers/recurring_transactions_controller.rb

  def show
    @recurring_transaction = RecurringTransaction.find(params[:id])
---
SELECT * FROM "recurring_transactions" WHERE ("recurring_transactions"."id" = 1)

  def edit
    @recurring_transaction = RecurringTransaction.find(params[:id])
---
SELECT * FROM "recurring_transactions" WHERE ("recurring_transactions"."id" = 1)

  def create
    @recurring_transaction = RecurringTransaction.new(params[:recurring_transaction])

    respond_to do |format|
      if @recurring_transaction.save
---
INSERT INTO "recurring_transactions" ("updated_at", "description", "amount", "base_date", "frequency", "created_at") VALUES('2009-02-06 03:01:09', 'Prêt Étudiant', -89.71, '2005-06-01', 3, '2009-02-06 03:01:09')

  def update
    @recurring_transaction = RecurringTransaction.find(params[:id])

    respond_to do |format|
      if @recurring_transaction.update_attributes(params[:recurring_transaction])
---
SELECT * FROM "recurring_transactions" WHERE ("recurring_transactions"."id" = 1)
UPDATE "recurring_transactions" SET "base_date" = '2009-01-01', "updated_at" = '2009-02-06 03:03:43' WHERE "id" = 2

  def destroy
    @recurring_transaction = RecurringTransaction.find(params[:id])
    @recurring_transaction.destroy
---
SELECT * FROM "recurring_transactions" WHERE ("recurring_transactions"."id" = 16)
DELETE FROM "recurring_transactions" WHERE "id" = 16