trunk/budget/app/controllers/transactions_controller.rb

  def index
    @period = Period.find(params[:period_id])
---
SELECT * FROM "periods" WHERE ("periods"."id" = 6)

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 30)

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 1)

  def create
    @period = Period.find(params[:period_id])
    @transaction = @period.transactions.build(params[:transaction])

    respond_to do |format|
      if @transaction.save
---
SELECT * FROM "periods" WHERE ("periods"."id" = 1)
INSERT INTO "transactions" ("updated_at", "date", "processed", "description", "amount", "period_id", "created_at") VALUES('2009-02-14 14:02:24', '2009-02-12', 't', 'Achat /METRO FAMILLE MARTEL', -20.87, 10, '2009-02-14 14:02:24')

  def update
    @transaction = Transaction.find(params[:id])

    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])
---
SELECT * FROM "transactions" WHERE ("transactions".period_id = 9)
UPDATE "transactions" SET "processed" = 'f', "amount" = 1779.0, "updated_at" = '2009-02-06 03:53:05' WHERE "id" = 30

  def destroy
    @transaction = Transaction.find(params[:id])
    @period = @transaction.period
    @transaction.destroy
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 56)
DELETE FROM "transactions" WHERE "id" = 56