budget/app/controllers/periods_controller.rb

SELECT * FROM "periods" WHERE ("periods"."id" = 1)
---
  def show
    @period = Period.find(params[:id])

SELECT * FROM "periods" WHERE ("periods"."id" = 6)
---
  def edit
    @period = Period.find(params[:id])

INSERT INTO "periods" ("start_date", "end_date", "updated_at", "created_at") VALUES('2009-01-29', '2009-02-11', '2009-02-09 03:01:01', '2009-02-09 03:01:01')
INSERT INTO "transactions" ("updated_at", "date", "processed", "description", "amount", "period_id", "created_at") VALUES('2009-02-06 03:34:26', '2009-01-01', NULL, 'Prêt Étudiant', -89.71, 6, '2009-02-06 03:34:26')
---
  def create
    @period = Period.new(params[:period])
    @period.append_recurring_transactions

    respond_to do |format|
      if @period.save

SELECT * FROM "periods" WHERE ("periods"."id" = 2)
DELETE FROM "periods" WHERE "id" = 2
---
  def destroy
    @period = Period.find(params[:id])
    @period.destroy